<details><summary>Digger run report at 2023-10-15 12:39:47 (UTC)</summary>
            <details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_argocd-apps</b></summary>
  
```terraform
Terraform will perform the following actions:

  # kubernetes_manifest.argocd_apps[0] will be created
  + resource "kubernetes_manifest" "argocd_apps" {
      + manifest = {
          + apiVersion = "argoproj.io/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + annotations = {}
              + finalizers  = [
                  + "resources-finalizer.argocd.argoproj.io",
                ]
              + name        = "alpha-k8s"
              + namespace   = "argocd"
            }
          + spec       = {
              + destination = {
                  + server = "https://kubernetes.default.svc"
                }
              + project     = "default"
              + source      = {
                  + path           = "apps"
                  + repoURL        = "https://github.com/rimvydascivilis/alpha-k8s.git"
                  + targetRevision = "main"
                }
              + syncPolicy  = {
                  + automated   = {
                      + allowEmpty = true
                      + prune      = true
                      + selfHeal   = true
                    }
                  + syncOptions = [
                      + "Validate=true",
                      + "CreateNamespace=true",
                      + "PrunePropagationPolicy=Foreground",
                      + "PruneLast=true",
                    ]
                }
            }
        }
      + object   = {
          + apiVersion = "argoproj.io/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = [
                  + "resources-finalizer.argocd.argoproj.io",
                ]
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "alpha-k8s"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + operation  = {
              + info        = (known after apply)
              + initiatedBy = {
                  + automated = (known after apply)
                  + username  = (known after apply)
                }
              + retry       = {
                  + backoff = {
                      + duration    = (known after apply)
                      + factor      = (known after apply)
                      + maxDuration = (known after apply)
                    }
                  + limit   = (known after apply)
                }
              + sync        = {
                  + dryRun       = (known after apply)
                  + manifests    = (known after apply)
                  + prune        = (known after apply)
                  + resources    = (known after apply)
                  + revision     = (known after apply)
                  + revisions    = (known after apply)
                  + source       = {
                      + chart          = (known after apply)
                      + directory      = {
                          + exclude = (known after apply)
                          + include = (known after apply)
                          + jsonnet = {
                              + extVars = (known after apply)
                              + libs    = (known after apply)
                              + tlas    = (known after apply)
                            }
                          + recurse = (known after apply)
                        }
                      + helm           = {
                          + fileParameters          = (known after apply)
                          + ignoreMissingValueFiles = (known after apply)
                          + parameters              = (known after apply)
                          + passCredentials         = (known after apply)
                          + releaseName             = (known after apply)
                          + skipCrds                = (known after apply)
                          + valueFiles              = (known after apply)
                          + values                  = (known after apply)
                          + valuesObject            = (known after apply)
                          + version                 = (known after apply)
                        }
                      + kustomize      = {
                          + commonAnnotations         = (known after apply)
                          + commonAnnotationsEnvsubst = (known after apply)
                          + commonLabels              = (known after apply)
                          + forceCommonAnnotations    = (known after apply)
                          + forceCommonLabels         = (known after apply)
                          + images                    = (known after apply)
                          + namePrefix                = (known after apply)
                          + nameSuffix                = (known after apply)
                          + namespace                 = (known after apply)
                          + replicas                  = (known after apply)
                          + version                   = (known after apply)
                        }
                      + path           = (known after apply)
                      + plugin         = {
                          + env        = (known after apply)
                          + name       = (known after apply)
                          + parameters = (known after apply)
                        }
                      + ref            = (known after apply)
                      + repoURL        = (known after apply)
                      + targetRevision = (known after apply)
                    }
                  + sources      = (known after apply)
                  + syncOptions  = (known after apply)
                  + syncStrategy = {
                      + apply = {
                          + force = (known after apply)
                        }
                      + hook  = {
                          + force = (known after apply)
                        }
                    }
                }
            }
          + spec       = {
              + destination          = {
                  + name      = (known after apply)
                  + namespace = (known after apply)
                  + server    = "https://kubernetes.default.svc"
                }
              + ignoreDifferences    = (known after apply)
              + info                 = (known after apply)
              + project              = "default"
              + revisionHistoryLimit = (known after apply)
              + source               = {
                  + chart          = (known after apply)
                  + directory      = {
                      + exclude = (known after apply)
                      + include = (known after apply)
                      + jsonnet = {
                          + extVars = (known after apply)
                          + libs    = (known after apply)
                          + tlas    = (known after apply)
                        }
                      + recurse = (known after apply)
                    }
                  + helm           = {
                      + fileParameters          = (known after apply)
                      + ignoreMissingValueFiles = (known after apply)
                      + parameters              = (known after apply)
                      + passCredentials         = (known after apply)
                      + releaseName             = (known after apply)
                      + skipCrds                = (known after apply)
                      + valueFiles              = (known after apply)
                      + values                  = (known after apply)
                      + valuesObject            = (known after apply)
                      + version                 = (known after apply)
                    }
                  + kustomize      = {
                      + commonAnnotations         = (known after apply)
                      + commonAnnotationsEnvsubst = (known after apply)
                      + commonLabels              = (known after apply)
                      + forceCommonAnnotations    = (known after apply)
                      + forceCommonLabels         = (known after apply)
                      + images                    = (known after apply)
                      + namePrefix                = (known after apply)
                      + nameSuffix                = (known after apply)
                      + namespace                 = (known after apply)
                      + replicas                  = (known after apply)
                      + version                   = (known after apply)
                    }
                  + path           = "apps"
                  + plugin         = {
                      + env        = (known after apply)
                      + name       = (known after apply)
                      + parameters = (known after apply)
                    }
                  + ref            = (known after apply)
                  + repoURL        = "https://github.com/rimvydascivilis/alpha-k8s.git"
                  + targetRevision = "main"
                }
              + sources              = (known after apply)
              + syncPolicy           = {
                  + automated                = {
                      + allowEmpty = true
                      + prune      = true
                      + selfHeal   = true
                    }
                  + managedNamespaceMetadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  + retry                    = {
                      + backoff = {
                          + duration    = (known after apply)
                          + factor      = (known after apply)
                          + maxDuration = (known after apply)
                        }
                      + limit   = (known after apply)
                    }
                  + syncOptions              = [
                      + "Validate=true",
                      + "CreateNamespace=true",
                      + "PrunePropagationPolicy=Foreground",
                      + "PruneLast=true",
                    ]
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
kubernetes_manifest.argocd_apps[0]: Creating...
kubernetes_manifest.argocd_apps[0]: Creation complete after 1s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>

<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

available_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
  "us-east-1d",
  "us-east-1e",
  "us-east-1f",
])
first_3_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_ecr</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_partition.current: Reading...
aws_ecr_repository.this[0]: Refreshing state... [id=app]
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1155861060]
aws_ecr_repository_policy.this[0]: Refreshing state... [id=app]
aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=app]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

repository_arn = "arn:aws:ecr:us-east-1:039454511521:repository/app"
repository_registry_id = "039454511521"
repository_url = "039454511521.dkr.ecr.us-east-1.amazonaws.com/app"

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_eks</b></summary>
  
```terraform
module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-staging/cluster]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
aws_security_group.cluster[0]: Refreshing state... [id=sg-05890219a6bf9af90]
aws_security_group.node[0]: Refreshing state... [id=sg-0ca2da153d0daf958]
module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
module.kms.data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
module.kms.data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004]
aws_iam_role.this[0]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Reading...
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::039454511521:user/rimvydas]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004-20231015094025105700000006]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004-20231015094025235500000007]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003-20231015094025511500000008]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003-20231015094025526800000009]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004-20231015094025071300000005]
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2140828597]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=a68413f9-0ccb-432d-9e6a-8242adc0d7c3]
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3405753559]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-540475629]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-283244384]
aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3414948250]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2725044148]
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2925436700]
aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3520306298]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1265009655]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3651375350]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4013498392]
aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-883167668]
module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-staging]
aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101509404933230000000a]
aws_eks_cluster.this[0]: Refreshing state... [id=eks-staging]
aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003-2023101509404994080000000b]
time_sleep.this[0]: Refreshing state... [id=2023-10-15T09:49:37Z]
data.tls_certificate.this[0]: Reading...
data.aws_eks_addon_version.this["coredns"]: Reading...
aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-050856cd60bd80ded,Environment]
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-050856cd60bd80ded,Terraform]
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-08ea07b3e0e6f0968]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/898DC80DAE31B13C6EA9E89085DA115C]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-staging:general-2023101509493913430000000e]
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-staging:kube-proxy]
aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-staging:vpc-cni]
aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-staging:coredns]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "eks-staging:general-2023101509493913430000000e"
      + labels                 = {}
        tags                   = {
            "Environment" = "staging"
            "Name"        = "general"
            "Terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Changes to Outputs:
  ~ eks_managed_node_groups                          = {
      ~ general = {
          ~ node_group_labels                  = null -> {}
            # (15 unchanged attributes hidden)
        }
    }

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.

Warning: Argument is deprecated

  with aws_eks_addon.this["kube-proxy"],
  on main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 2 more similar warnings elsewhere)

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

aws_auth_configmap_yaml = <<EOT
apiVersion: v1
kind: ConfigMap
metadata:
  name: aws-auth
  namespace: kube-system
data:
  mapRoles: |
    - rolearn: arn:aws:iam::039454511521:role/general-eks-node-group-20231015094024023800000004
      username: system:node:{{EC2PrivateDNSName}}
      groups:
        - system:bootstrappers
        - system:nodes

EOT
cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:039454511521:log-group:/aws/eks/eks-staging/cluster"
cloudwatch_log_group_name = "/aws/eks/eks-staging/cluster"
cluster_addons = {
  "coredns" = {
    "addon_name" = "coredns"
    "addon_version" = "v1.10.1-eksbuild.4"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/coredns/b8c5995f-9132-7541-4bd3-48be551a4a51"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-15T09:51:09Z"
    "id" = "eks-staging:coredns"
    "modified_at" = "2023-10-15T09:51:47Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "kube-proxy" = {
    "addon_name" = "kube-proxy"
    "addon_version" = "v1.28.2-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/kube-proxy/60c5995f-9131-d521-2ba6-3ed012c151a5"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-15T09:51:10Z"
    "id" = "eks-staging:kube-proxy"
    "modified_at" = "2023-10-15T09:51:43Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "vpc-cni" = {
    "addon_name" = "vpc-cni"
    "addon_version" = "v1.15.1-eksbuild.1"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/vpc-cni/56c5995f-9137-4da0-05e6-370063f2ae00"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-15T09:51:09Z"
    "id" = "eks-staging:vpc-cni"
    "modified_at" = "2023-10-15T09:52:13Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
}
cluster_arn = "arn:aws:eks:us-east-1:039454511521:cluster/eks-staging"
cluster_certificate_authority_data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJTzh6T1plVHZReUl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFd01UVXdPVFF3TWpCYUZ3MHpNekV3TVRJd09UUTFNakJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURIeElUc25ua0ZCaElpQ05KQ01td0pjalliTkQwY1JFRXljUG5YdTAxNkVUR1d0cFNLRUZybXVGWEEKa3BINzZnYWY5Lzgya3JJcDQ0elFiSGNUMUpxQjZwNFlTbmxDQVluRTZWMitNM2J6WnFMcGdBaDNwZnBrMDB2MwpmYTkyb0FDMVlpUUpMZTVNYnZOV1Rjenlta0FzSVowbUJWS3NlUTg5V1ZDdmpyZmNQNmxjOStwK3NKdzUydkM4CjRWckRFaGs4SDJDc1lMUGI5WmFVU0s1UGFyZlI3S3RsWC9jN1FXdTFwenBSMS9ObjQ1OXBwT2ZpdHhvZEQ1SFEKWVIyMmdSZVY2YTh5NDFUeDhZVG05bHlnMXE3dUY3SWpEYVcvdkE0SGdXbXJ4ZjhQQTJ4TjVRM29nMnV0ZndFagpDSVNnVDhRZURBNk44TFNIWXV5cHpSbmxjcEJ2QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSK1RiMWFlbE5tdEw1UFJPdlhhc0Jodk9aeEpqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQU9OOWJKQXVnTAp6T1l5NHlzeDF4b3B6cXB3VzFlTlhJMEhNOWxBdkcveFYvTHVwdWhuamFoN0Jtak1aZUxLY3RmZWdxYk11TnhGCnRjcTYzTlhHdkJwZUNycXIzeHJaNktKeDRWRHJOL2tYbzd6N250dTJwd3pOMTFITnpDK1lqbGFmZElkMUZYNnoKUzJ2TzNxdDFiN3o3R2xOdGloT0pZQXg3VWFVL0lJUTFlMlpveVNVdGV0aHI0RHlvREVsNmE1OEIzNnVBUGlzaQpFNld1WUc4QmszYWZMMjhPSmZXNjZWK1JJRmRCMHRUR0FEWTF0ZDdBdUFOVHNiZEU0b05FTk01dm1kL0V0S1lpCm5TaWFUY1VqN25Gbk9BeG9IWFVHYm4ySWdxSlN1VzJiL1NKQXZaZDBkdnBHYnJKUCtZQ2ZxSU1lamJzMThrVUgKVUlGNzBlekpjTkFsCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
cluster_endpoint = "https://898DC80DAE31B13C6EA9E89085DA115C.gr7.us-east-1.eks.amazonaws.com"
cluster_iam_role_arn = "arn:aws:iam::039454511521:role/eks-staging-cluster-20231015094024023800000003"
cluster_iam_role_name = "eks-staging-cluster-20231015094024023800000003"
cluster_iam_role_unique_id = "AROAQSL5MCGQ423SG4YQG"
cluster_identity_providers = {}
cluster_name = "eks-staging"
cluster_oidc_issuer_url = "https://oidc.eks.us-east-1.amazonaws.com/id/898DC80DAE31B13C6EA9E89085DA115C"
cluster_platform_version = "eks.2"
cluster_primary_security_group_id = "sg-050856cd60bd80ded"
cluster_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-05890219a6bf9af90"
cluster_security_group_id = "sg-05890219a6bf9af90"
cluster_status = "ACTIVE"
cluster_tls_certificate_sha1_fingerprint = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
cluster_version = "1.28"
eks_managed_node_groups = {
  "general" = {
    "autoscaling_group_schedule_arns" = {}
    "iam_role_arn" = "arn:aws:iam::039454511521:role/general-eks-node-group-20231015094024023800000004"
    "iam_role_name" = "general-eks-node-group-20231015094024023800000004"
    "iam_role_unique_id" = "AROAQSL5MCGQ4JWFMUDP7"
    "launch_template_arn" = "arn:aws:ec2:us-east-1:039454511521:launch-template/lt-08ea07b3e0e6f0968"
    "launch_template_id" = "lt-08ea07b3e0e6f0968"
    "launch_template_latest_version" = 1
    "launch_template_name" = "general-2023101509493860670000000c"
    "node_group_arn" = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101509493913430000000e/16c5995e-e298-5611-b38c-08634cdc636f"
    "node_group_autoscaling_group_names" = [
      "eks-general-2023101509493913430000000e-16c5995e-e298-5611-b38c-08634cdc636f",
    ]
    "node_group_id" = "eks-staging:general-2023101509493913430000000e"
    "node_group_labels" = tomap({})
    "node_group_resources" = tolist([
      {
        "autoscaling_groups" = tolist([
          {
            "name" = "eks-general-2023101509493913430000000e-16c5995e-e298-5611-b38c-08634cdc636f"
          },
        ])
        "remote_access_security_group_id" = ""
      },
    ])
    "node_group_status" = "ACTIVE"
    "node_group_taints" = toset([])
    "platform" = "linux"
  }
}
eks_managed_node_groups_autoscaling_group_names = tolist([
  "eks-general-2023101509493913430000000e-16c5995e-e298-5611-b38c-08634cdc636f",
])
fargate_profiles = {}
kms_key_arn = "arn:aws:kms:us-east-1:039454511521:key/a68413f9-0ccb-432d-9e6a-8242adc0d7c3"
kms_key_id = "a68413f9-0ccb-432d-9e6a-8242adc0d7c3"
kms_key_policy = "{\"Statement\":[{\"Action\":[\"kms:Update*\",\"kms:UntagResource\",\"kms:TagResource\",\"kms:ScheduleKeyDeletion\",\"kms:Revoke*\",\"kms:Put*\",\"kms:List*\",\"kms:Get*\",\"kms:Enable*\",\"kms:Disable*\",\"kms:Describe*\",\"kms:Delete*\",\"kms:Create*\",\"kms:CancelKeyDeletion\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:user/rimvydas\"},\"Resource\":\"*\",\"Sid\":\"KeyAdministration\"},{\"Action\":[\"kms:ReEncrypt*\",\"kms:GenerateDataKey*\",\"kms:Encrypt\",\"kms:DescribeKey\",\"kms:Decrypt\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:role/eks-staging-cluster-20231015094024023800000003\"},\"Resource\":\"*\",\"Sid\":\"KeyUsage\"}],\"Version\":\"2012-10-17\"}"
node_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-0ca2da153d0daf958"
node_security_group_id = "sg-0ca2da153d0daf958"
oidc_provider = "oidc.eks.us-east-1.amazonaws.com/id/898DC80DAE31B13C6EA9E89085DA115C"
oidc_provider_arn = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/898DC80DAE31B13C6EA9E89085DA115C"
self_managed_node_groups = {}
self_managed_node_groups_autoscaling_group_names = tolist([])

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/helm v2.11.0
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_iam_policy.argocd_image_updater[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-argocd-image-updater]
data.aws_iam_openid_connect_provider.this: Reading...
data.aws_eks_cluster.eks: Reading...
data.aws_eks_cluster_auth.eks: Reading...
aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-autoscaler]
aws_iam_policy.aws_load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-load-balancer-controller]
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=eks-staging]
data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/898DC80DAE31B13C6EA9E89085DA115C]
data.aws_iam_policy_document.cluster_autoscaler: Reading...
data.aws_iam_policy_document.argocd_image_updater: Reading...
data.aws_iam_policy_document.aws_load_balancer_controller: Reading...
data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=648629919]
data.aws_iam_policy_document.argocd_image_updater: Read complete after 0s [id=2597480549]
data.aws_iam_policy_document.aws_load_balancer_controller: Read complete after 0s [id=1604338201]
aws_iam_role.argocd_image_updater[0]: Refreshing state... [id=eks-staging-argocd-image-updater]
aws_iam_role.cluster_autoscaler[0]: Refreshing state... [id=eks-staging-cluster-autoscaler]
aws_iam_role.aws_load_balancer_controller[0]: Refreshing state... [id=eks-staging-load-balancer-controller]
data.aws_eks_cluster.eks: Read complete after 0s [id=eks-staging]
aws_iam_role_policy_attachment.cluster_autoscaler[0]: Refreshing state... [id=eks-staging-cluster-autoscaler-20231015095238874300000003]
aws_iam_role_policy_attachment.aws_load_balancer_controller[0]: Refreshing state... [id=eks-staging-load-balancer-controller-20231015095238868600000002]
aws_iam_role_policy_attachment.argocd_image_updater[0]: Refreshing state... [id=eks-staging-argocd-image-updater-20231015095238839000000001]
helm_release.sealed_secrets[0]: Refreshing state... [id=sealed-secrets]
helm_release.aws_load_balancer_controller[0]: Refreshing state... [id=aws-load-balancer-controller]
helm_release.argocd_image_updater[0]: Refreshing state... [id=argocd-image-updater]
helm_release.cluster_autoscaler[0]: Refreshing state... [id=autoscaler]
helm_release.argocd[0]: Refreshing state... [id=argocd]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

eks_name = "eks-staging"

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-0fdb35a53cc7d2958]
aws_default_security_group.this[0]: Refreshing state... [id=sg-015a73e3e5eaf635d]
aws_route_table.private[0]: Refreshing state... [id=rtb-04d95bdd404c03c0d]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-054dd6ff9cfcbfbfe]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f32ef0a6ee18aaa0]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-0dafe96b446f2e330]
aws_subnet.private[0]: Refreshing state... [id=subnet-0098da7f41117c74a]
aws_subnet.private[1]: Refreshing state... [id=subnet-07a114273b2f53ecb]
aws_subnet.private[2]: Refreshing state... [id=subnet-044bb744f0ec108f1]
aws_subnet.public[0]: Refreshing state... [id=subnet-0a818e51de2690442]
aws_subnet.public[1]: Refreshing state... [id=subnet-0d614196931ce537e]
aws_subnet.public[2]: Refreshing state... [id=subnet-0c2eab2c4f3d7020a]
aws_route_table.intra[0]: Refreshing state... [id=rtb-05854cdd8899397bb]
aws_route_table.public[0]: Refreshing state... [id=rtb-08caa0c9c9706459e]
aws_subnet.intra[0]: Refreshing state... [id=subnet-07106ab13ddbe4a13]
aws_subnet.intra[1]: Refreshing state... [id=subnet-02196947bbadb3787]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0c7e46310eabb8831]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0b99144a68a1d515e]
aws_subnet.intra[2]: Refreshing state... [id=subnet-01800f024769e74dd]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03931237ba29b6281]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e04f1b01cf83ff9d]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08caa0c9c9706459e1080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05274442d688182a5]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-01a6e9187b7b0a936]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03fda326a84d08a29]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-04f4949dac053aef2]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0d2481281c6c62a03]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0de100f714a375653]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-02d7cf62ef88790f0]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04d95bdd404c03c0d1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_nat_gateway_route_ids = []
database_route_table_association_ids = []
database_route_table_ids = tolist([
  "rtb-04d95bdd404c03c0d",
])
database_subnet_arns = []
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-054dd6ff9cfcbfbfe"
default_route_table_id = "rtb-0dafe96b446f2e330"
default_security_group_id = "sg-015a73e3e5eaf635d"
elasticache_route_table_association_ids = []
elasticache_route_table_ids = [
  "rtb-04d95bdd404c03c0d",
]
elasticache_subnet_arns = []
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:039454511521:internet-gateway/igw-0f32ef0a6ee18aaa0"
igw_id = "igw-0f32ef0a6ee18aaa0"
intra_route_table_association_ids = [
  "rtbassoc-0d2481281c6c62a03",
  "rtbassoc-04f4949dac053aef2",
  "rtbassoc-0de100f714a375653",
]
intra_route_table_ids = [
  "rtb-05854cdd8899397bb",
]
intra_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-07106ab13ddbe4a13",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-02196947bbadb3787",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-01800f024769e74dd",
]
intra_subnets = [
  "subnet-07106ab13ddbe4a13",
  "subnet-02196947bbadb3787",
  "subnet-01800f024769e74dd",
]
intra_subnets_cidr_blocks = tolist([
  "10.0.6.0/24",
  "10.0.7.0/24",
  "10.0.8.0/24",
])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "vpc-staging"
nat_ids = [
  "eipalloc-0c7e46310eabb8831",
]
nat_public_ips = tolist([
  "52.204.223.111",
])
natgw_ids = [
  "nat-02d7cf62ef88790f0",
]
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = [
  "r-rtb-04d95bdd404c03c0d1080289494",
]
private_route_table_association_ids = [
  "rtbassoc-03931237ba29b6281",
  "rtbassoc-0e04f1b01cf83ff9d",
  "rtbassoc-0b99144a68a1d515e",
]
private_route_table_ids = [
  "rtb-04d95bdd404c03c0d",
]
private_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0098da7f41117c74a",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-07a114273b2f53ecb",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-044bb744f0ec108f1",
]
private_subnets = [
  "subnet-0098da7f41117c74a",
  "subnet-07a114273b2f53ecb",
  "subnet-044bb744f0ec108f1",
]
private_subnets_cidr_blocks = tolist([
  "10.0.0.0/24",
  "10.0.1.0/24",
  "10.0.2.0/24",
])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_route_id = "r-rtb-08caa0c9c9706459e1080289494"
public_route_table_association_ids = [
  "rtbassoc-05274442d688182a5",
  "rtbassoc-03fda326a84d08a29",
  "rtbassoc-01a6e9187b7b0a936",
]
public_route_table_ids = [
  "rtb-08caa0c9c9706459e",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0a818e51de2690442",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0d614196931ce537e",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0c2eab2c4f3d7020a",
]
public_subnets = [
  "subnet-0a818e51de2690442",
  "subnet-0d614196931ce537e",
  "subnet-0c2eab2c4f3d7020a",
]
public_subnets_cidr_blocks = tolist([
  "10.0.3.0/24",
  "10.0.4.0/24",
  "10.0.5.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([
  "rtb-04d95bdd404c03c0d",
])
redshift_subnet_arns = []
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vpc_arn = "arn:aws:ec2:us-east-1:039454511521:vpc/vpc-0fdb35a53cc7d2958"
vpc_cidr_block = "10.0.0.0/16"
vpc_enable_dns_hostnames = true
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_id = "vpc-0fdb35a53cc7d2958"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-0dafe96b446f2e330"
vpc_owner_id = "039454511521"
vpc_secondary_cidr_blocks = tolist([])

  ```
</details>

</details>